Revit 2026 API

# ElementPhaseStatusFilter Class

---

A filter used to match elements that have a given phase status on a given phase.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementSlowFilter Autodesk.Revit.DBElementPhaseStatusFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementPhaseStatusFilter : ElementSlowFilter
```
```vb
Public Class ElementPhaseStatusFilter
	Inherits ElementSlowFilter
```
```cpp
public ref class ElementPhaseStatusFilter : public ElementSlowFilter
```
```fsharp
type ElementPhaseStatusFilter =
    class
        inherit ElementSlowFilter
    end
```

The ElementPhaseStatusFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementPhaseStatusFilter(ElementId, ElementOnPhaseStatus) | Constructs a new instance of a file to match elements that have a given phase status on the input phase. |
|  | ElementPhaseStatusFilter(ElementId, ICollectionElementOnPhaseStatus) | Initializes a new instance of the ElementPhaseStatusFilter class |
|  | ElementPhaseStatusFilter(ElementId, ElementOnPhaseStatus, Boolean) | Constructs a new instance of a file to match elements that have a given phase status on the input phase, with the option to match all elements that have a phase status other than the input status. |
|  | ElementPhaseStatusFilter(ElementId, ICollectionElementOnPhaseStatus, Boolean) | Initializes a new instance of the ElementPhaseStatusFilter class |

|  | Name | Description |
| --- | --- | --- |
|  | Inverted | True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted. (Inherited from ElementFilter) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ElementFilter) |
|  | PhaseId | The phase id. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from ElementFilter) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetPhaseStatuses | Returns the phase statuses assigned to this filter. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | PassesFilter(Element) | Applies the filter to a given element. (Inherited from ElementFilter) |
|  | PassesFilter(Document, ElementId) | Applies the filter to a given element. (Inherited from ElementFilter) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This filter is a slow filter. Slow filters require that the Element be obtained and expanded in memory first. Thus it is preferable to couple this filter with at least one ElementQuickFilter, which should minimize the number of Elements that are expanded.

#### Reference

Autodesk.Revit.DB Namespace